tutorials/2D_example_steady/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application     PNPNSFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1; // 1;
deltaT          1;
writeControl    timeStep;
writeInterval   1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
libs ("libzeroIonicFlux.so" "libslipEOF.so" "libElectrochemicalSystem.so");
nInIter 15; //15;
nNSPNPIteration  100;
PNPNStransient no;

/*
C1C2convergence  1e-3; //1e-3;
solveNS yes;
saveVtkFiles no;
saveDesaltPhysics no;
*/
// ************************************************************************* //
