tutorials/2D_example_steady/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
       	type            zeroGradient;
    }
    top
    {
       	type            zeroGradient;
    }
/*
    periodic
    {
	type            cyclic;// zeroGradient;
    }

    periodic2
    {
	type            cyclic;// zeroGradient;
    }
*/


    wall
    {
	type            zeroGradient;
    }  
}


// ************************************************************************* //
